app/controllers/products_controller.rb

  def show
    product = Product.find_by(id: params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    product = Product.new(product_params)

    if product.save!
---
INSERT INTO "products" ("name", "description", "img_url", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "apple"], ["description", "red"], ["img_url", "apple.jpg"], ["price", 10], ["created_at", "2020-01-16 23:03:55.097792"], ["updated_at", "2020-01-16 23:03:55.097792"]]